In [1]:
import pymysql
import pyinputplus as pyip
import pandas as pd
from tkinter import *

In [2]:
conn = pymysql.connect(host='127.0.0.1', user='root', password=pyip.inputStr(), db='market_db', charset='utf8')

In [3]:
cur = conn.cursor()

In [4]:
cur.execute("SELECT * FROM member")

10

In [5]:
conn.commit()

In [6]:
conn.close()

In [7]:
conn = pymysql.connect(host='127.0.0.1', user='root', password=pyip.inputStr(), db='market_db', charset='utf8')
sentence = "SELECT * FROM member"

In [8]:
pd.read_sql(sentence, con=conn)

C:\Users\admin\AppData\Roaming\Python\Python310\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

  mem_id mem_name  mem_number addr phone1    phone2  height  debut_date
0    APN     에이핑크           6   경기    031  77777777     164  2011-02-10
1    BLK     블랙핑크           4   경남    055  22222222     163  2016-08-08
2    GRL     소녀시대           8   서울     02  44444444     168  2007-08-02
3    ITZ       잇지           5   경남   None      None     167  2019-02-12
4    MMU      마마무           4   전남    061  99999999     165  2014-06-19
5    OMY     오마이걸           7   서울   None      None     160  2015-04-21
6    RED     레드벨벳           4   경북    054  55555555     161  2014-08-01
7    SPC     우주소녀          13   서울     02  88888888     162  2016-02-25
8    TWC     트와이스           9   서울     02  11111111     167  2015-10-19
9    WMN     여자친구           6   경기    031  33333333     166  2015-01-15

In [9]:
conn.close()